# -*- coding: utf-8 -*-
"""
Created on Sat Sep 28 13:19:17 2019

@author: Administrator
"""

"""
颠倒二进制位Reverse Bits
颠倒给定的 32 位无符号整数的二进制位。

示例 1：

输入: 00000010100101000001111010011100
输出: 00111001011110000010100101000000
解释: 输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
      因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
示例 2：

输入：11111111111111111111111111111101
输出：10111111111111111111111111111111
解释：输入的二进制串 11111111111111111111111111111101 表示无符号整数 4294967293，
      因此返回 3221225471 其二进制表示形式为 10101111110010110010011101101001。
。"""
def reverseBits(n):
    res = 0
    count = 32
    
    while count:
        res <<= 1
        """ m左移一位"""
        res |= n&1
        """m的末位设置为n的末位"""
        n >>= 1
        """n向右移1位"""
        count -= 1
        
    return int(bin(res), 2)


print(reverseBits(4294967293))

